app/controllers/videos_controller.rb

  def find_category_info
    category_id=params["category"].to_i
    cat=Category.find(category_id)
---
SELECT  `categories`.* FROM `categories` WHERE `categories`.`id` = 3 LIMIT 1